/* ***********************************************************************************************
* 
* Mac OS X EMBEDDED
* Localizable Strings
*
 *********************************************************************************************** */


/* Alert  strings */
"OK" = "ตกลง";
"Cancel" = "ยกเลิก";
"Disconnect" = "เลิกเชื่อมต่อ";

"Settings" = "ตั้งค่า";
"Ignore" = "เพิกเฉย";

/* Notification window title */
"Network Connection" = "การเชื่อมต่อเครือข่าย";
"VPN Connection" = "การเชื่อมต่อ VPN";

/* Misc messages */
"Waiting for disconnection" = "กำลังรอการเลิกใช้ PPP อยู่…";

/*  
    PPP error strings
    
    PPP will display one of the following LastCause published in the service/state
    of the PPP dictionnary.
    PPP errors contain a PPP generic part in the key "LastCause".
    and a Device specific part in the key "DeviceLastCause".
    
    The Device specific part is there to give more details of the PPP error.
    For example, for a PPP Error 8, meaning that the connection has failed, 
    we can have a Device Error detailing the failure cause, like Busy, NoDialTone...
    
    Therefore, if the device specific part is not 0, 
    PPP will display the device error message, that is defained in the bundle of the 
    corresponding PPP subtype (for example PPPSerial.ppp).
    If the Device specific part is 0, then PPP will display the PPP message.
    Device error must be formatted "Device Error %d".
    
    Device errors start from 1. PPP Error start from 0.
    If the text for the error does not exist, the error number will be displayed.
    If the text for the error exist but is empty, nothing will be displayed 
	PPP Error 5 is normal exit error and is special case in the code.  
*/

"PPP Error 0" = "เซิร์ฟเวอร์ PPP ตัดการเชื่อมต่อ ลองเชื่อมต่ออีกครั้ง";
"PPP Error 1" = "ไม่สามารถเชื่อมต่อได้ เนื่องจากข้อผิดพลาดที่เรียกกลับคืนไม่ได้ ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
"PPP Error 2" = "ไม่สามารถเชื่อมต่อได้ เนื่องจากค่าติดตั้ง PPP ไม่ถูกต้อง ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง";
"PPP Error 3" = "PPP ไม่มีสิทธิเพียงพอในการทำงานได้อย่างถูกต้อง";
"PPP Error 4" = "ไม่พบส่วนขยายเคอร์เนล PPP";
/* "PPP Error 5" = ""; */ /* normal exit, nothing to display. this is special case in the code */
"PPP Error 6" = "ไม่สามารถล็อก"; /* not supported */
"PPP Error 7" = "ไม่สามารถเชื่อมต่อได้ เนื่องจากอุปกรณ์สื่อสารไม่พร้อมใช้ ตรวจให้แน่ใจว่าอุปกรณ์สื่อสารต่อกับคอมพิวเตอร์ของคุณ และลองเชื่อมต่ออีกครั้ง";
"PPP Error 8" = "ไม่สามารถเชื่อมต่อได้ ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
"PPP Error 9" = "การเชื่อมต่อกับเทอร์มินัลล้มเหลว ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง"; /* not supported */
"PPP Error 10" = "ไม่สามารถสร้างการเชื่อมต่อกับเซิร์ฟเวอร์ PPP ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
"PPP Error 11" = "ไม่สามารถยืนยันเซิร์ฟเวอร์ PPP"; /* not supported */
"PPP Error 12" = "การเชื่อมต่อถูกตัดขาด เนื่องจากไม่มีการใช้งาน";
"PPP Error 13" = "การเชื่อมต่อถูกตัดขาด เนื่องจากถึงขีดจำกัดเวลา";
"PPP Error 14" = "Callback ไม่ผ่าน"; /* not supported */
"PPP Error 15" = "การเชื่อมต่อถูกตัดขาด เนื่องจากเซิร์ฟเวอร์ PPP ไม่ตอบกลับ ลองเชื่อมต่ออีกครั้ง";
"PPP Error 16" = "อุปกรณ์สื่อสารตัดการเชื่อมต่อ ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจสอบค่าติดตั้งของคุณ";
"PPP Error 17" = "พบการเชื่อมต่อข้ามกัน ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง";
"PPP Error 18" = "ไม่สามารถติดต่อเริ่มต้น PPP";
"PPP Error 19" = "การยืนยันไม่ผ่าน";
"PPP Error 20" = "เทอร์มินัลสคริปต์ทำงานล้มเหลว ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง";
"PPP Error 21" = "ไม่พบอุปกรณ์สื่อสารสำหรับการติดต่อของคุณ ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง";
"PPP Error 22" = "การเชื่อมต่อถูกตัดขาด เนื่องจากถึงขีดจำกัดจำนวนข้อมูลรับส่ง";
"PPP Error 23" = "ผู้ใช้ไม่มีสิทธิให้เข้าอ่าน";
"PPP Error 24" = "ไม่มีสิทธิติดต่อหมายเลขทางไกล ตรวจสอบค่าติดตั้งของคุณและลองอีกครั้ง";
"PPP Error 25" = "ไม่สามารถติดต่อเซิร์ฟเวอร์ ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
"PPP Error 127" = "การเชื่อมต่อถูกตัดขาด ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจสอบค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";

/* 
	PPP Device errors
	The following errors are PPP Link specific. 
	When returned by the link, they provide more accurate error than the generic PPP error.
*/

"L2TP Error 1" = "ไม่สามารถติดต่อเซิร์ฟเวอร์ L2TP-VPN ตรวจสอบที่อยู่เซิร์ฟเวอร์และลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ติดต่อผู้ดูแลระบบของคุณ";
"L2TP Error 2" = "เซิร์ฟเวอร์ L2TP-VPN ไม่ตอบกลับ ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
"L2TP Error 5" = "ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ L2TP-VPN ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจสอบค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
/* From HI guidelines: we should never show the disconnection errors below */
"L2TP Error 6" = ""; /* "You have been disconnected from the L2TP server because the network configuration changed."; */
"L2TP Error 7" = "ข้อมูลลับ IPSec หายไป ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง";
"L2TP Error 8" = "ใบรับรอง IPSec หายไป ตรวจสอบค่าติดตั้งของคุณและลองเชื่อมต่ออีกครั้ง";
"L2TP Error 9" = "ไม่มีเครือข่ายเชื่อมต่อ"; /* EDGE connection failed */


"PPTP Error 1" = "ไม่สามารถติดต่อเซิร์ฟเวอร์ PPTP-VPN ตรวจสอบที่อยู่เซิร์ฟเวอร์และลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ติดต่อผู้ดูแลระบบของคุณ";
"PPTP Error 2" = "เซิร์ฟเวอร์ PPTP-VPN ไม่ตอบกลับ ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
"PPTP Error 5" = "ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ PPTP-VPN  ลองเชื่อมต่ออีกครั้ง หากยังเกิดปัญหาอยู่ ตรวจสอบค่าติดตั้งและติดต่อผู้ดูแลระบบของคุณ";
/* From HI guidelines: we should never show the disconnection errors below */
"PPTP Error 6" = ""; /* "You have been disconnected from the PPTP server because the network configuration changed."; */
"PPTP Error 7" = "ไม่มีเครือข่ายเชื่อมต่อ"; /* EDGE connection failed */



/*  
    IPSec error strings
    
    IPSec will display one of the following errors.
*/

/* "IPSec Error 0" = ""; */ /* no error */
"IPSec Error 1" = "ข้อผิดพลาดไม่คาดหวังเกิดขึ้น"; /* Generic error */
"IPSec Error 2" = "ไม่ได้ระบุที่อยู่เซิร์ฟเวอร์ VPN"; /* No Server Address error */
"IPSec Error 3" = "ไม่ได้ระบุข้อมูลลับ VPN"; /* No Shared Secret error */
"IPSec Error 4" = "ไม่ได้ระบุใบรับรอง VPN"; /* No Certificate error */
"IPSec Error 5" = "ไม่พบเซิร์ฟเวอร์ VPN"; /* Server Address did not resolve error */
"IPSec Error 6" = "ไม่มีเครือข่ายเชื่อมต่อ"; /* No Local Network error */
"IPSec Error 7" = "ข้อผิดพลาดการกำหนดค่าเกิดขึ้น"; /* Configuration error */
"IPSec Error 8" = "ข้อผิดพลาดที่ไม่สามารถเรียกคืนกลับมาเกิดขึ้น"; /* Racoon Control error */
"IPSec Error 9" = "เซิร์ฟเวอร์ VPN ไม่ตอบกลับมา"; /* Connection error */
"IPSec Error 10" = "การยืนยันกับเซิร์ฟเวอร์ VPN ไม่ผ่าน"; /* Negotiation error */
"IPSec Error 11" = "ข้อมูลลับ VPN ไม่ถูกต้อง"; /* Invalid Shared Secret error */
"IPSec Error 12" = "ไม่สามารถยันยันใบรับรองเซิร์ฟเวอร์์์"; /* Certificate authentication error */
"IPSec Error 13" = "การยืนยันใบรับรองไม่ผ่าน"; /* Certificate authentication error */
"IPSec Error 13, Re-enroll" = "การยืนยันใบรับรองล้มเหลว ติดต่อผู้ดูแลระบบของคุณหรือลองสมัครอีกครั้งในตั้งค่า"; /* Certificate authentication error with Fix Me button */
"IPSec Error 14" = "การยืนยันผู้ใช้ไม่ผ่าน"; /* XAUTH User Authentication error */
/* From HI guidelines: we should never show the disconnection errors below */
"IPSec Error 15" = ""; /* "You have been disconnected from the VPN server because the network configuration changed."; */ /* Network changed error */
"IPSec Error 16" = ""; /* "The connection was terminated by the VPN server. Try reconnecting."; */ /* Peer Disconnection error */
"IPSec Error 17" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"IPSec Error 18" = "ไม่มีเครือข่ายให้เชื่อมต่อ"; /* EDGE connection failed */
"IPSec Error 19" = ""; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"IPSec Error 20" = "ใบรับรองของคุณก่อนกำหนดเวลาใช้"; /* Client Certificate date not yet valid */
"IPSec Error 20, Re-enroll" = "ใบรับรองของคุณก่อนกำหนดเวลาใช้ ติดต่อผู้ดูแลระบบเครือข่ายของคุณหรือลองสมัครอีกครั้งในตั้งค่า"; /* Client Certificate date not yet valid */
"IPSec Error 21" = "ใบรับรองของคุณหมดเวลาใช้แล้ว"; /* Certificate expired error */
"IPSec Error 21, Re-enroll" = "ใบรับรองของคุณหมดเวลาใช้ ติดต่อผู้ดูแลระบบเครือข่ายของคุณหรือลองสมัครอีกครั้งในตั้งค่า"; /* Certificate expired error with Fix Me button */
"IPSec Error 22" = "ใบรับรองเซิร์ฟเวอร์ก่อนกำหนดเวลาใช้ ติดต่อผู้ดูแลระบบเครือข่ายของคุณ"; /* Server Certificate date not yet valid */
"IPSec Error 23" = "ใบรับรองเซิร์ฟเวอร์หมดเวลาใช้แล้ว ติดต่อผู้ดูแลระบบเครือข่ายของคุณ"; /* Server Certificate expiry error */
"IPSec Error 24" = "หมายเลขประจำตัวใบรับรองเซิร์ฟเวอร์ไม่ถูกต้อง ติดต่อผู้ดูแลระบบเครือข่ายของคุณ"; /* Server Certificate ID mismatched or unexpected */

/* 
	IPSec XAuth strings
	Ipsec will use those strings in the User Authentication dialogs
*/ 
"Enter your user authentication" = "ใส่ข้อมูลยืนยันผู้ใช้ของคุณ";
"Enter Username and Password." = "ใส่ข้อมูลยืนยันผู้ใช้ของคุณ";
"Answer" = "ตอบกลับ";
"Next PIN" = "รหัส PIN ถัดไป";
"Account" = "บัญชีผู้ใช้";
"Passcode" = "รหัสผ่าน";
"Password" = "รหัสผ่าน";


/*  
    VPN error strings
    
    VPN will display one of the following errors.
*/

/* "VPN Error 0" = ""; */ /* no error */
"VPN Error 1" = "ข้อผิดพลาดไม่คาดหวังเกิดขึ้น"; /* Generic error */
"VPN Error 2" = "ไม่ได้ระบุที่อยู่เซิร์ฟเวอร์ VPN"; /* No Server Address error */
"VPN Error 3" = "ไม่ได้ระบุใบรับรอง VPN"; /* No Certificate error */
"VPN Error 4" = "ไม่พบเซิร์ฟเวอร์ VPN"; /* Server Address did not resolve error */
"VPN Error 5" = "ไม่มีเครือข่ายให้เชื่อมต่อ"; /* No Local Network error */
"VPN Error 6" = "ข้อผิดพลาดการกำหนดค่าเกิดขึ้น"; /* Configuration error */
"VPN Error 7" = "ข้อผิดพลาดที่ไม่สามารถเรียกคืนกลับมาเกิดขึ้น"; /* Control error */
"VPN Error 8" = "เซิร์ฟเวอร์ VPN ไม่ตอบกลับมา"; /* Connection error */

/* From HI guidelines: we should never show the disconnection errors below */
"VPN Error 9" = ""; /* "You have been disconnected from the VPN server because the network configuration changed."; */ /* Network changed error */
"VPN Error 10" = ""; /* "The connection was terminated by the VPN server. Try reconnecting."; */ /* Peer Disconnection error */
"VPN Error 11" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"VPN Error 12" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"VPN Error 13" = ""; /* negotiation error */
"VPN Error 14" = "การยืนยันผู้ใช้ไม่ผ่าน"; /* XAUTH User Authentication error */
"VPN Error 15" = "ไม่มีเครือข่ายให้เชื่อมต่อ"; /* EDGE connection failed */
"VPN Error 16" = ""; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"VPN Error 17" = "ที่อยู่เซิร์ฟเวอร์ไม่ถูกต้อง"; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"VPN Error 18" = "การเชื่อมต่อ VPN ต้องการให้แอพพลิเคชันเริ่มต้นทำงาน"; /* "The VPN connection requires an application to start up."; */ /* Application required error */
"VPN Error 20" = "ใบรับรองของคุณก่อนกำหนดเวลาใช้"; /* Client Certificate date not yet valid */
"VPN Error 20, Re-enroll" = "ใบรับรองของคุณก่อนกำหนดเวลาใช้ ติดต่อผู้ดูแลระบบเครือข่ายของคุณหรือลองสมัครอีกครั้งในตั้งค่า"; /* Client Certificate date not yet valid */
"VPN Error 21" = "ใบรับรองของคุณหมดเวลาใช้แล้ว"; /* Certificate expired error */
"VPN Error 21, Re-enroll" = "ใบรับรองของคุณหมดเวลาใช้ ติดต่อผู้ดูแลระบบเครือข่ายของคุณหรือลองสมัครอีกครั้งในตั้งค่า"; /* Certificate expired error with Fix Me button */
"VPN Error 22" = "ใบรับรองเซิร์ฟเวอร์ก่อนกำหนดเวลาใช้ ติดต่อผู้ดูแลระบบเครือข่ายของคุณ"; /* Server Certificate date not yet valid */
"VPN Error 23" = "ใบรับรองเซิร์ฟเวอร์หมดเวลาใช้แล้ว ติดต่อผู้ดูแลระบบเครือข่ายของคุณ"; /* Server Certificate expiry error */
"VPN Error 24" = "หมายเลขประจำตัวใบรับรองเซิร์ฟเวอร์ไม่ถูกต้อง ติดต่อผู้ดูแลระบบเครือข่ายของคุณ"; /* Server Certificate ID mismatched or unexpected */
"VPN Error 25" = "";																	/* Plugin Update */
"VPN Error 26" = "โปรดเปิดแอพพลิเคชันของ VPN เพื่อเปิดใช้การเชื่อมต่อแบบ VPN";			/* plugin needs to be enabled */

"net.juniper.sslvpn" = "โปรดเปิด Junos Pulse เพื่อเปิดใช้การเชื่อมต่อแบบ VPN";
"com.cisco.anyconnect.applevpn.plugin" = "โปรดเปิด AnyConnect เพื่อเปิดใช้การเชื่อมต่อแบบ VPN";
